Random Forest

In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("./Datasets/User_Data.csv")
df.head(10)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0
7  15694829  Female   32           150000          1
8  15600575    Male   25            33000          0
9  15727311  Female   35            65000          0

In [5]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df["Gender"] = le.fit_transform(df["Gender"])

In [6]:
df.head(10)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510       1   19            19000          0
1  15810944       1   35            20000          0
2  15668575       0   26            43000          0
3  15603246       0   27            57000          0
4  15804002       1   19            76000          0
5  15728773       1   27            58000          0
6  15598044       0   27            84000          0
7  15694829       0   32           150000          1
8  15600575       1   25            33000          0
9  15727311       0   35            65000          0

In [10]:
x = df.iloc[:,1:4]
y = df.iloc[:,-1]

In [12]:
x , y

(     Gender  Age  EstimatedSalary
 0         1   19            19000
 1         1   35            20000
 2         0   26            43000
 3         0   27            57000
 4         1   19            76000
 ..      ...  ...              ...
 395       0   46            41000
 396       1   51            23000
 397       0   50            20000
 398       1   36            33000
 399       0   49            36000

 [400 rows x 3 columns],
 0      0
 1      0
 2      0
 3      0
 4      0
       ..
 395    1
 396    1
 397    1
 398    0
 399    1
 Name: Purchased, Length: 400, dtype: int64)

In [24]:
from sklearn.model_selection import train_test_split

x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = .20)

In [25]:
from sklearn.ensemble import RandomForestClassifier

clf = RandomForestClassifier()
clf.fit(x_train,y_train)
y_pred = clf.predict(x_test)

In [26]:
from sklearn.metrics import accuracy_score , confusion_matrix
score = accuracy_score(y_pred , y_test)
cm = confusion_matrix(y_pred , y_test)

In [27]:
print(score)
print(cm)

0.8625
[[49  5]
 [ 6 20]]